# Filename Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DefinitionFile..::..Filename Property
DefinitionFile Class See Also
---
This property returns the physical filename of the shared parameters file on disk.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string Filename { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Filename As String
	Get
```

Visual C++
---
```text
public:
property String^ Filename {
	String^ get ();
}
```

# See Also
DefinitionFile Class
Autodesk.Revit.DB Namespace